<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download Cacidi 2021</string>
	<key>Identifier</key>
	<string>com.github.kwik.download.cacidi2021</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cacidi2021</string>
		<key>FILENAME</key>
		<string>EXSUCC2021.pkg</string>
		<key>URL</key>
		<string>https://www.cacidi.com/download/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%%FILENAME%</string>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>CodeSignatureVerifier</string>
		    <key>Arguments</key>
		    <dict>
		        <key>input_path</key>
		        <string>%pathname%</string>
				<key>expected_authority_names</key>
        		<array>
            		<string>Developer ID Installer: CACIDI Aps (A6GW48X352)</string>
            		<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
        		</array>
		    </dict>
		</dict>
	</array>
</dict>
</plist>
