Description: Downloads the latest version of fleetctl and ...
Identifier: com.github.kwik.munki.fleetdm-bind
ParentRecipe: com.github.kwik.pkg.fleetdm-bind
MinimumVersion: 2.4.0

Input:
  MUNKI_REPO_SUBDIR: 'utilities/fleetdm-bind'
    
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%fleetbindpkg%'
    
