Description: Downloads the latest version of fleetctl and ...
Identifier: com.github.kwik.pkg.fleetdm-bind
ParentRecipe: com.github.kitzy.download.fleetctl
MinimumVersion: 2.4.0

Input:
  FLEET_SERVER_URL: 'https://example.com'
  FLEET_SERVER_ENROLL_SECRET: 'replace this in override'

Process:
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/unarchived/fleetctl_v*_macos/%NAME%'
    find_method: glob
- Processor: com.github.kwik.SharedProcessors/FleetBindPkg
  Arguments:
    fleetctl_path: '%found_filename%'
