<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for Switch from NCH Software. Finds and downloads the latest zip'ed Switch release disk image and unzips it.</string>
	<key>Identifier</key>
	<string>com.github.kwik.munki.NCHSwitch</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NCHSwitch</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Switch is one of the most stable, easy-to-use, and comprehensive multi format audio file converters available.</string>
            <key>display_name</key>
            <string>NCH Switch</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.kwik.download.NCHSwitch</string>	
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
